import type { NextPage } from 'next'
import { Article, Card } from 'ui'
import { Banner, Brands, NavBar, Title } from '../components'
import { GetStaticProps } from 'next'
import { getClient } from '../utils/cms/sanity.server'
import groq from 'groq'
import { Product, toProduct, toProductList } from 'logic'
import { ProductList } from '../components/content/ProductList'

interface IHomeProps {
  novelty: Product[]
  products: Product[]
}

const Home: NextPage<IHomeProps> = ({ products, novelty }) => {
  console.log(novelty)
  return (
    <div>
      <Title val='Сигнал' />
      <NavBar />

      <div className='container-xl'>
        <Banner />

        <div className='my-5'>
          <h2 className='mb-3'>Популярні товари</h2>
          <ProductList items={novelty} />
        </div>

        <div className='my-5'>
          <h2 className='mb-3'>Ми продаємо запчастини для наступних марок</h2>
          <Brands />
        </div>

        <Article className='my-5'
          header='Як правильно купити запчастини?'
          paragraphs={[
            'Якщо вам необхідно купити запчастини моторної групи, ходової або ж до коробки передач, то тут радимо не гнатися за максимальною економією. Це пов`язано з тим, що у неоригінальних запчастин ресурс експлуатації менший, ніж в оригінальної запчастини. Якщо ж Вам необхідно замінити ручку від дверей, або фару, то в цьому випадку допустимо вдатися до економії',
            'Запчастини слід купувати тільки там, де на вашу покупку дадуть гарантію. А у разі виявлення браку буде кому виставити претензію.',
            'Завжди необхідно давати оцінку продавцеві, не важливо - це інтернет-магазин запчастин, або ж торговий кіоск на ринку. Перш за все, звертайте увагу на асортимент запчастин і професійну компетентність продавця або консультанта. Якщо ж у процесі підбору запчастин у Вас виникли будь-які сумніви, то варто відмовитися від покупки в цьому місці.',
            'Ви повинні розуміти, що у разі виникнення у продавця труднощів із підбору запчастин на ваш автомобіль за номером кузова (VIN-коду є велика ймовірність того, що куплена запчастини не підійде для вашого авто.',
            'Ви повинні розуміти, що у разі виникнення у продавця труднощів із підбору запчастин на ваш автомобіль за номером кузова (VIN-коду є велика ймовірність того, що куплена запчастини не підійде для вашого авто.',
            'Велику популярність в частині продажу запчастин отримали online-ресурси, серед них і наш - інтернет-магазин запчастин dok.ua Для наших клієнтів ми вирішили не тільки задачу в простій і зручній купівлі запчастин, а й подбали про їх оперативну доставку на всій території України. Користуючись сайтом інтернет-магазину ДОК, ви зможете підібрати потрібні вам запчастини того чи іншого виробника, виходячи з марки вашого автомобіля, його моделі, модифікації, року випуску і ціни, яку ви готові заплатити. dok.ua - це найбільш повноцінний каталог запчастин для іномарок, а також максимально зручний пошук як за артикулом запчастини, так і за її назвою та виробником. Нашими незаперечними перевагами є надання консультацій висококваліфікованих експертів, які завжди допоможуть у правильному підборі тієї чи іншої запчастини. Ціни на запчастини в інтернет-магазині набагато дешевші, ніж на автобазарі або ж на СТО. Крім цього, купуючи запчастини в dok.ua, ви спокійні за їх сумісність із Вашим автомобілем.',
          ]} />
      </div>
    </div>
  )
}

export const getStaticProps: GetStaticProps = async ({ preview = false }) => {
  const client = getClient(preview)

  const novelty = await client.fetch(
    groq`*[_type == 'product'] | order(_createdAt asc)[0...5]`
  ).then<Product>(toProductList)

  const products = await client.fetch(
    groq`*[_type == 'product']`
  ).then<Product>(toProductList)

  return {
    props: {
      products,
      novelty
    },
    revalidate: 10,
  }
}

export default Home
